# ЛИСТЫ
# my_list = [1, 2, 3]
# print(type(my_list))

# вывести предлоежние списком с разделителем
# text = 'Hello world'
# my_list1 = text.split(' ')
# print(my_list1)

# получить квадрат последовательности цифр
# numbers = [1, 2, 3, 4, 5]
# for i in numbers:
#     print(i ** 2)

# методы работы со списками
#.append() - добавляет элемент в конец списка
#.extend() - добавляет элементы в конец списка (добавляет в список другой список)
#.insert() - добавляет элемент по индексу
#.remove() - удаляет элемент по значению
#.reverse() - переворачивает список
#clear() - очищает список
#.index() - возвращает индекс элемента
#.sort() - сортирует список (НО! НЕ ИЗМЕНЯЕТ СПИСОК)
#sorted() - возвращает отсортированный список (ИЗМЕНЯЕТ INDEX СПИСКА - применяется с print())
#.count() - возвращает количество элементов
#sum() - возвращает сумму элементов
#min() - возвращает минимальное значение
#max() - возвращает максимальное значение

# КОРТЕЖИ
# my_tuple = (1, 2, 3)
# print(type(my_tuple))

#СЛОВАРИ
# my_dict = {
#     'key1': 'value1',
#     'key2': 'value2',
#     'key3': 32
# }
# print(my_dict)

# print(my_dict['key1']) #вывод только одного значения
# my_dict['key4'] = 'new value' #добавление нового значения

# for item in my_dict.items():
#     print(item) #распечатать списком, а не строкой

#В словарях все ключи должны быть уникальными, иначе произойдет перезапись старого значения

#МНОЖЕСТВА (похожи на словари с отброшенными значениями)
set1 = {1, 2, 3, 4, 5, 'one', 'two', 'three'}
set2 = {1, 2, 3, 4, 5, 'one', 'two', 'three', 100, 200}
set3 = {1, 2, 3}





